---
kind: method
id: M:Autodesk.Revit.DB.CurveLoop.GetCurveLoopIterator
source: html/56bdb38b-2385-7e32-13db-6cfd6dbe3e65.htm
---
# Autodesk.Revit.DB.CurveLoop.GetCurveLoopIterator Method

Returns a curve that iterates through the curve loop.

## Syntax (C#)
```csharp
public CurveLoopIterator GetCurveLoopIterator()
```

## Returns
A curve loop iterator object that can be used to iterate through key-value pairs in the collection.